#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_cloudwatch_log_group.publishing_tweet_loggroup: Refreshing state... [id=/aws/lambda/MTGBot_publishing_tweet]
aws_cloudwatch_log_group.fetching_card_loggroup: Refreshing state... [id=/aws/lambda/MTGBot_fetching_card]
aws_iam_role.fetching_card_role: Refreshing state... [id=MTGBot_fetching_card_role]
module.s3-bucket.aws_s3_bucket.this[0]: Refreshing state... [id=mtgbot-image-storage]
module.sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/846845394796/mtgbot_queue]
aws_ssm_parameter.access_token_secret: Refreshing state... [id=/twitter/credentials/access_token_secret]
aws_ssm_parameter.consumer_secret: Refreshing state... [id=/twitter/credentials/consumer_secret]
aws_ssm_parameter.consumer_key: Refreshing state... [id=/twitter/credentials/consumer_key]
aws_cloudwatch_event_rule.fetch_MTG_card_every_4_hours: Refreshing state... [id=fetch_MTG_card_every_4_hours]
aws_lambda_layer_version.lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer:1]
aws_ssm_parameter.access_token: Refreshing state... [id=/twitter/credentials/access_token]
aws_iam_role.publishing_tweet_role: Refreshing state... [id=MTGBot_publishing_tweet_role]
aws_iam_role_policy_attachment.lambda-basic-exec-role-policy-attach: Refreshing state... [id=MTGBot_fetching_card_role-20191012142851337700000001]
aws_iam_role_policy_attachment.publishing-tweet-lambda-basic-exec-role-policy-attach: Refreshing state... [id=MTGBot_publishing_tweet_role-20191012142851368200000002]
aws_lambda_function.fetching_card: Refreshing state... [id=MTGBot_fetching_card]
aws_iam_policy.fetching-card-policy: Refreshing state... [id=arn:aws:iam::846845394796:policy/MTGBot-Fetching-card-righs]
aws_iam_policy.publishing-tweet-policy: Refreshing state... [id=arn:aws:iam::846845394796:policy/MTGBot-Publishing-tweet-righs]
aws_iam_role_policy_attachment.fetching-card-policy-attach: Refreshing state... [id=MTGBot_fetching_card_role-20191012142909605500000004]
aws_iam_role_policy_attachment.publishing-tweet-policy-attach: Refreshing state... [id=MTGBot_publishing_tweet_role-20191012142907422500000003]
aws_lambda_permission.allow_cloudwatch_to_call_fetching_card: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.check_foo_every_five_minutes: Refreshing state... [id=fetch_MTG_card_every_4_hours-lambda_fetching_card_mtg]
aws_lambda_function.publishing_tweet: Refreshing state... [id=MTGBot_publishing_tweet]
aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=0ac67916-db41-403c-871d-4a046332c0de]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.fetching_card will be updated in-place
  ~ resource "aws_lambda_function" "fetching_card" {
        id                             = "MTGBot_fetching_card"
      ~ last_modified                  = "2019-11-17T15:12:46.232+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.7" -> "python3.8"
      ~ source_code_hash               = "39ZxEq6iqhIsBiWeQJKE2muRT1mnfVP1e8QPdHg6iJE=" -> "I7ObS4WzJOjyBz3enBYL98cJ/+vqJAidYfIkuzrjLyo="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "MTG-Twitter-Bot"
            "Terraform"   = "true"
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.publishing_tweet will be updated in-place
  ~ resource "aws_lambda_function" "publishing_tweet" {
        id                             = "MTGBot_publishing_tweet"
      ~ last_modified                  = "2019-10-12T14:31:20.411+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.7" -> "python3.8"
      ~ source_code_hash               = "MW9U7NJ1YUmmnkAi7UJlAr011sxz7FIYsOBCdzx6Lxo=" -> "evKE0Snw9agP14ZwwkPaTRkRBWe+m7+RrpYvu1gQO/o="
        tags                           = {
            "Environment" = "dev"
            "Project"     = "MTG-Twitter-Bot"
            "Terraform"   = "true"
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                 = "arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer:1" -> (known after apply)
      ~ compatible_runtimes = [ # forces replacement
          - "python3.7",
          + "python3.8",
        ]
      ~ created_date        = "2019-10-12T14:31:13.038+0000" -> (known after apply)
      ~ id                  = "arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer:1" -> (known after apply)
      ~ layer_arn           = "arn:aws:lambda:eu-west-1:846845394796:layer:MTGBot_BaseLibraryLayer" -> (known after apply)
      ~ source_code_hash    = "YMPc1SRDg3r1WfonNyJcqBIWaWauGy2JpAclSZEsC1s=" -> (known after apply)
      ~ source_code_size    = 10424463 -> (known after apply)
      ~ version             = "1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @jbrt, Action: `pull_request`*